Ewalk02/fishduino/sdkconfig.defaults
#
# Fishduino defaults (ESP32-P4-WIFI6 + 4-DSI-TOUCH-A)
#

CONFIG_IDF_TARGET="esp32p4"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# CONFIG_ESPTOOLPY_FLASHSIZE_2MB is not set

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set

CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Prefer PSRAM on ESP32-P4 builds that use DSI framebuffers.
CONFIG_SPIRAM=y

# Keep log noise reasonable during bring-up.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Waveshare 4-DSI-TOUCH-A (480x800)
CONFIG_BSP_LCD_TYPE_480_800_4_INCH_A=y
CONFIG_BSP_LCD_COLOR_FORMAT_RGB565=y

# ESP-Hosted Wi-Fi (ESP32-C6 coprocessor over SDIO)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64

# SNTP
CONFIG_LWIP_SNTP_MAX_SERVERS=1

# Fluval hosted BLE (NimBLE central on P4 host, controller on onboard ESP32-C6 via ESP-Hosted VHCI)
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y

# Default Fluval transport: compile hosted BLE stack; integration remains disabled until enabled in NVS/UI
CONFIG_FISHDUINO_FLUVAL_DEFAULT_TRANSPORT_HOSTED_BLE=y
# CONFIG_FISHDUINO_FLUVAL_DEFAULT_TRANSPORT_DISABLED is not set


# ESP32-P4 v1.x board support
# This board reports ESP32-P4 revision v1.3, so do not build for v3.1+ only.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
# CONFIG_ESP32P4_REV_MIN_300 is not set
# CONFIG_ESP32P4_REV_MIN_301 is not set
CONFIG_ESP32P4_REV_MIN_FULL=100
CONFIG_ESP_REV_MIN_FULL=100
CONFIG_ESP32P4_REV_MAX_FULL=199
CONFIG_ESP_REV_MAX_FULL=199

# Headless (no DSI panel): uncomment for console-only testing, then rm -f sdkconfig && idf.py set-target esp32p4
# CONFIG_FISHDUINO_HEADLESS=y

# Cockpit dashboard typography
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
